import pandas as pd
import urllib.request
import zipfile

from table import db


def bestchange():
    zip = 'info.zip'
    url = 'http://api.bestchange.ru/info.zip'
    urllib.request.urlretrieve(url, zip)
    with zipfile.ZipFile(zip, 'r') as zip_file:
        zip_file.extract('bm_rates.dat', '.')


    columns = ['ID отдаваемой валюты', 'ID получаемой валюты', 'ID обменного пункта', 'Курс обмена (отдать)',
               'Курс обмена (получить)', 'Резерв получаемой валюты', 'Отзывы', 'Не используется',
               'Минимальная сумма обмена', 'Максимальная сумма обмена', 'ID города (для направлений с наличными)']

    data = pd.read_csv('bm_rates.dat', encoding='Windows-1251', header=None, sep=";", names=columns)
    df = pd.DataFrame(data)
    df = df[(df['ID отдаваемой валюты'] == 52) | (df['ID отдаваемой валюты'] == 42) | (df['ID отдаваемой валюты'] == 63) | (
            df['ID отдаваемой валюты'] == 105) | (df['ID отдаваемой валюты'] == 93) |
            (df['ID отдаваемой валюты'] == 131) |
            (df['ID отдаваемой валюты'] == 74) |
            (df['ID отдаваемой валюты'] == 172) |
            (df['ID отдаваемой валюты'] == 184) |
            (df['ID отдаваемой валюты'] == 139) |
            (df['ID отдаваемой валюты'] == 212) |
            (df['ID отдаваемой валюты'] == 218) |
            (df['ID отдаваемой валюты'] == 160) |
            (df['ID отдаваемой валюты'] == 99) |
            (df['ID отдаваемой валюты'] == 161) |
            (df['ID отдаваемой валюты'] == 149) |
            (df['ID отдаваемой валюты'] == 115) |
            (df['ID отдаваемой валюты'] == 138) |
            (df['ID отдаваемой валюты'] == 140) |
            (df['ID отдаваемой валюты'] == 162) |
            (df['ID отдаваемой валюты'] == 163) |
            (df['ID отдаваемой валюты'] == 36) |
            (df['ID отдаваемой валюты'] == 10) |
            (df['ID отдаваемой валюты'] == 208) |
            (df['ID отдаваемой валюты'] == 180) |
            (df['ID отдаваемой валюты'] == 23) |
            (df['ID отдаваемой валюты'] == 110) |
            (df['ID отдаваемой валюты'] == 235) |
            (df['ID отдаваемой валюты'] == 228) |
            (df['ID отдаваемой валюты'] == 24) |
            (df['ID отдаваемой валюты'] == 189) |
            (df['ID отдаваемой валюты'] == 203) |
            (df['ID отдаваемой валюты'] == 206) |
            (df['ID отдаваемой валюты'] == 174) |
            (df['ID отдаваемой валюты'] == 173) |
            (df['ID отдаваемой валюты'] == 177) |
            (df['ID отдаваемой валюты'] == 178) |
            (df['ID отдаваемой валюты'] == 179) |
            (df['ID отдаваемой валюты'] == 181) |
            (df['ID отдаваемой валюты'] == 182) |
            (df['ID отдаваемой валюты'] == 185) |
            (df['ID отдаваемой валюты'] == 133) |
            (df['ID отдаваемой валюты'] == 48) |
            (df['ID отдаваемой валюты'] == 124) |
            (df['ID отдаваемой валюты'] == 168) |
            (df['ID отдаваемой валюты'] == 16) |
            (df['ID отдаваемой валюты'] == 19) |
            (df['ID отдаваемой валюты'] == 104) |
            (df['ID отдаваемой валюты'] == 134) |
            (df['ID отдаваемой валюты'] == 27) |
            (df['ID отдаваемой валюты'] == 61) |
            (df['ID отдаваемой валюты'] == 135) |
            (df['ID отдаваемой валюты'] == 26) |
            (df['ID отдаваемой валюты'] == 197) |
            (df['ID отдаваемой валюты'] == 198) |
            (df['ID отдаваемой валюты'] == 175) |
            (df['ID отдаваемой валюты'] == 201) |
            (df['ID отдаваемой валюты'] == 202) |
            (df['ID отдаваемой валюты'] == 205) |
            (df['ID отдаваемой валюты'] == 82) |
            (df['ID отдаваемой валюты'] == 8) |
            (df['ID отдаваемой валюты'] == 210) |
            (df['ID отдаваемой валюты'] == 32) |
            (df['ID отдаваемой валюты'] == 216) |
            (df['ID отдаваемой валюты'] == 213) |
            (df['ID отдаваемой валюты'] == 217) |
            (df['ID отдаваемой валюты'] == 220) |
            (df['ID отдаваемой валюты'] == 227) |
            (df['ID отдаваемой валюты'] == 2) |
            (df['ID отдаваемой валюты'] == 76) |
            (df['ID отдаваемой валюты'] == 144) |
            (df['ID отдаваемой валюты'] == 209)]

    df.loc[(df['ID отдаваемой валюты'] == 52), 'ID отдаваемой валюты'] = 'RUB Альфа-Банк'
    df.loc[(df['ID отдаваемой валюты'] == 42), 'ID отдаваемой валюты'] = 'RUB Сбербанк'
    df.loc[(df['ID отдаваемой валюты'] == 63), 'ID отдаваемой валюты'] = 'RUB QIWI'
    df.loc[(df['ID отдаваемой валюты'] == 105), 'ID отдаваемой валюты'] = 'RUB Тинькофф'
    df.loc[(df['ID отдаваемой валюты'] == 93), 'ID отдаваемой валюты'] = 'Bitcoin (BTC)'
    df.loc[(df['ID отдаваемой валюты'] == 131), 'ID отдаваемой валюты'] = 'Bitcoin LN (BTC)'
    df.loc[(df['ID отдаваемой валюты'] == 43), 'ID отдаваемой валюты'] = 'Bitcoin BEP20 (BTCB)'
    df.loc[(df['ID отдаваемой валюты'] == 184), 'ID отдаваемой валюты'] = 'Bitcoin Gold (BTG)'
    df.loc[(df['ID отдаваемой валюты'] == 139), 'ID отдаваемой валюты'] = 'Ethereum (ETH)'
    df.loc[(df['ID отдаваемой валюты'] == 212), 'ID отдаваемой валюты'] = 'Ethereum BEP20 (ETH)'
    df.loc[(df['ID отдаваемой валюты'] == 218), 'ID отдаваемой валюты'] = 'Wrapped ETH (WETH)'
    df.loc[(df['ID отдаваемой валюты'] == 160), 'ID отдаваемой валюты'] = 'Ether Classic (ETC)'
    df.loc[(df['ID отдаваемой валюты'] == 99), 'ID отдаваемой валюты'] = 'Litecoin (LTC)'
    df.loc[(df['ID отдаваемой валюты'] == 161), 'ID отдаваемой валюты'] = 'Ripple (XRP)'
    df.loc[(df['ID отдаваемой валюты'] == 149), 'ID отдаваемой валюты'] = 'Monero (XMR)'
    df.loc[(df['ID отдаваемой валюты'] == 115), 'ID отдаваемой валюты'] = 'Dogecoin (DOGE),DOGE'
    df.loc[(df['ID отдаваемой валюты'] == 140), 'ID отдаваемой валюты'] = 'Dash (DASH)'
    df.loc[(df['ID отдаваемой валюты'] == 162), 'ID отдаваемой валюты'] = 'Zcash (ZEC)'
    df.loc[(df['ID отдаваемой валюты'] == 163), 'ID отдаваемой валюты'] = 'Tether Omni (USDT)'
    df.loc[(df['ID отдаваемой валюты'] == 36), 'ID отдаваемой валюты'] = 'Tether ERC20 (USDT)'
    df.loc[(df['ID отдаваемой валюты'] == 10), 'ID отдаваемой валюты'] = 'Tether TRC20 (USDT)'
    df.loc[(df['ID отдаваемой валюты'] == 208), 'ID отдаваемой валюты'] = 'Tether BEP20 (USDT)'
    df.loc[(df['ID отдаваемой валюты'] == 180), 'ID отдаваемой валюты'] = 'Tether SOL (USDT)'
    df.loc[(df['ID отдаваемой валюты'] == 23), 'ID отдаваемой валюты'] = 'USDCoin ERC20 (USDC)'
    df.loc[(df['ID отдаваемой валюты'] == 110), 'ID отдаваемой валюты'] = 'USDCoin TRC20 (USDC)'
    df.loc[(df['ID отдаваемой валюты'] == 235), 'ID отдаваемой валюты'] = 'USDCoin BEP20 (USDC)'
    df.loc[(df['ID отдаваемой валюты'] == 228), 'ID отдаваемой валюты'] = 'USDCoin SOL (USDC)'
    df.loc[(df['ID отдаваемой валюты'] == 24), 'ID отдаваемой валюты'] = 'TrueUSD (TUSD)'
    df.loc[(df['ID отдаваемой валюты'] == 189), 'ID отдаваемой валюты'] = 'Pax Dollar (USDP)'
    df.loc[(df['ID отдаваемой валюты'] == 203), 'ID отдаваемой валюты'] = 'Dai (DAI)'
    df.loc[(df['ID отдаваемой валюты'] == 206), 'ID отдаваемой валюты'] = 'Binance USD (BUSD)'
    df.loc[(df['ID отдаваемой валюты'] == 174), 'ID отдаваемой валюты'] = 'TerraUSD (UST)'
    df.loc[(df['ID отдаваемой валюты'] == 173), 'ID отдаваемой валюты'] = 'NEM (XEM)'
    df.loc[(df['ID отдаваемой валюты'] == 177), 'ID отдаваемой валюты'] = 'NEO (NEO)'
    df.loc[(df['ID отдаваемой валюты'] == 178), 'ID отдаваемой валюты'] = 'EOS (EOS)'
    df.loc[(df['ID отдаваемой валюты'] == 179), 'ID отдаваемой валюты'] = 'IOTA (MIOTA)'
    df.loc[(df['ID отдаваемой валюты'] == 181), 'ID отдаваемой валюты'] = 'Cardano (ADA)'
    df.loc[(df['ID отдаваемой валюты'] == 182), 'ID отдаваемой валюты'] = 'Stellar (XLM)'
    df.loc[(df['ID отдаваемой валюты'] == 185), 'ID отдаваемой валюты'] = 'TRON (TRX)'
    df.loc[(df['ID отдаваемой валюты'] == 133), 'ID отдаваемой валюты'] = 'Waves (WAVES)'
    df.loc[(df['ID отдаваемой валюты'] == 48), 'ID отдаваемой валюты'] = 'OMG Network (OMG)'
    df.loc[(df['ID отдаваемой валюты'] == 124), 'ID отдаваемой валюты'] = 'Verge (XVG)'
    df.loc[(df['ID отдаваемой валюты'] == 168), 'ID отдаваемой валюты'] = '0x (ZRX)'
    df.loc[(df['ID отдаваемой валюты'] == 16), 'ID отдаваемой валюты'] = 'BinanceCoin BEP2 (BNB)'
    df.loc[(df['ID отдаваемой валюты'] == 19), 'ID отдаваемой валюты'] = 'BinanceCoin BEP20 (BNB)'
    df.loc[(df['ID отдаваемой валюты'] == 104), 'ID отдаваемой валюты'] = 'ICON (ICX)'
    df.loc[(df['ID отдаваемой валюты'] == 134), 'ID отдаваемой валюты'] = 'Komodo (KMD)'
    df.loc[(df['ID отдаваемой валюты'] == 27), 'ID отдаваемой валюты'] = 'BitTorrent (BTT)'
    df.loc[(df['ID отдаваемой валюты'] == 61), 'ID отдаваемой валюты'] = 'BAT (BAT)'
    df.loc[(df['ID отдаваемой валюты'] == 135), 'ID отдаваемой валюты'] = 'Ontology (ONT)'
    df.loc[(df['ID отдаваемой валюты'] == 26), 'ID отдаваемой валюты'] = 'Qtum (QTUM)'
    df.loc[(df['ID отдаваемой валюты'] == 197), 'ID отдаваемой валюты'] = 'Chainlink (LINK)'
    df.loc[(df['ID отдаваемой валюты'] == 198), 'ID отдаваемой валюты'] = 'Cosmos (ATOM)'
    df.loc[(df['ID отдаваемой валюты'] == 175), 'ID отдаваемой валюты'] = 'Tezos (XTZ)'
    df.loc[(df['ID отдаваемой валюты'] == 201), 'ID отдаваемой валюты'] = 'Polkadot (DOT)'
    df.loc[(df['ID отдаваемой валюты'] == 202), 'ID отдаваемой валюты'] = 'Uniswap (UNI)'
    df.loc[(df['ID отдаваемой валюты'] == 205), 'ID отдаваемой валюты'] = 'Ravencoin (RVN)'
    df.loc[(df['ID отдаваемой валюты'] == 82), 'ID отдаваемой валюты'] = 'Solana (SOL)'
    df.loc[(df['ID отдаваемой валюты'] == 8), 'ID отдаваемой валюты'] = 'VeChain (VET)'
    df.loc[(df['ID отдаваемой валюты'] == 210), 'ID отдаваемой валюты'] = 'Shiba ERC20 (SHIB)'
    df.loc[(df['ID отдаваемой валюты'] == 32), 'ID отдаваемой валюты'] = 'Shiba BEP20 (SHIB)'
    df.loc[(df['ID отдаваемой валюты'] == 216), 'ID отдаваемой валюты'] = 'Algorand (ALGO)'
    df.loc[(df['ID отдаваемой валюты'] == 213), 'ID отдаваемой валюты'] = 'Maker (MKR)'
    df.loc[(df['ID отдаваемой валюты'] == 217), 'ID отдаваемой валюты'] = 'Avalanche (AVAX)'
    df.loc[(df['ID отдаваемой валюты'] == 220), 'ID отдаваемой валюты'] = 'Yearn.finance (YFI)'
    df.loc[(df['ID отдаваемой валюты'] == 227), 'ID отдаваемой валюты'] = 'Decentraland (MANA)'
    df.loc[(df['ID отдаваемой валюты'] == 2), 'ID отдаваемой валюты'] = 'Terra (LUNA)'
    df.loc[(df['ID отдаваемой валюты'] == 76), 'ID отдаваемой валюты'] = 'NEAR Protocol (NEAR)'
    df.loc[(df['ID отдаваемой валюты'] == 144), 'ID отдаваемой валюты'] = 'Cronos (CRO)'
    df.loc[(df['ID отдаваемой валюты'] == 209), 'ID отдаваемой валюты'] = 'Toncoin (TON)'
    df.loc[(df['ID отдаваемой валюты'] == 172), 'ID отдаваемой валюты'] = 'Bitcoin Cash (BCH)'
    df.loc[(df['ID отдаваемой валюты'] == 138), 'ID отдаваемой валюты'] = 'Polygon (MATIC)'

    df = df[(df['ID получаемой валюты'] == 93) |
            (df['ID получаемой валюты'] == 131) |
            (df['ID получаемой валюты'] == 74) |
            (df['ID получаемой валюты'] == 172) |
            (df['ID получаемой валюты'] == 184) |
            (df['ID получаемой валюты'] == 139) |
            (df['ID получаемой валюты'] == 212) |
            (df['ID получаемой валюты'] == 218) |
            (df['ID получаемой валюты'] == 160) |
            (df['ID получаемой валюты'] == 99) |
            (df['ID получаемой валюты'] == 161) |
            (df['ID получаемой валюты'] == 149) |
            (df['ID получаемой валюты'] == 115) |
            (df['ID получаемой валюты'] == 138) |
            (df['ID получаемой валюты'] == 140) |
            (df['ID получаемой валюты'] == 162) |
            (df['ID получаемой валюты'] == 163) |
            (df['ID получаемой валюты'] == 36) |
            (df['ID получаемой валюты'] == 10) |
            (df['ID получаемой валюты'] == 208) |
            (df['ID получаемой валюты'] == 180) |
            (df['ID получаемой валюты'] == 23) |
            (df['ID получаемой валюты'] == 110) |
            (df['ID получаемой валюты'] == 235) |
            (df['ID получаемой валюты'] == 228) |
            (df['ID получаемой валюты'] == 24) |
            (df['ID получаемой валюты'] == 189) |
            (df['ID получаемой валюты'] == 203) |
            (df['ID получаемой валюты'] == 206) |
            (df['ID получаемой валюты'] == 174) |
            (df['ID получаемой валюты'] == 173) |
            (df['ID получаемой валюты'] == 177) |
            (df['ID получаемой валюты'] == 178) |
            (df['ID получаемой валюты'] == 179) |
            (df['ID получаемой валюты'] == 181) |
            (df['ID получаемой валюты'] == 182) |
            (df['ID получаемой валюты'] == 185) |
            (df['ID получаемой валюты'] == 133) |
            (df['ID получаемой валюты'] == 48) |
            (df['ID получаемой валюты'] == 124) |
            (df['ID получаемой валюты'] == 168) |
            (df['ID получаемой валюты'] == 16) |
            (df['ID получаемой валюты'] == 19) |
            (df['ID получаемой валюты'] == 104) |
            (df['ID получаемой валюты'] == 134) |
            (df['ID получаемой валюты'] == 27) |
            (df['ID получаемой валюты'] == 61) |
            (df['ID получаемой валюты'] == 135) |
            (df['ID получаемой валюты'] == 26) |
            (df['ID получаемой валюты'] == 197) |
            (df['ID получаемой валюты'] == 198) |
            (df['ID получаемой валюты'] == 175) |
            (df['ID получаемой валюты'] == 201) |
            (df['ID получаемой валюты'] == 202) |
            (df['ID получаемой валюты'] == 205) |
            (df['ID получаемой валюты'] == 82) |
            (df['ID получаемой валюты'] == 8) |
            (df['ID получаемой валюты'] == 210) |
            (df['ID получаемой валюты'] == 32) |
            (df['ID получаемой валюты'] == 216) |
            (df['ID получаемой валюты'] == 213) |
            (df['ID получаемой валюты'] == 217) |
            (df['ID получаемой валюты'] == 220) |
            (df['ID получаемой валюты'] == 227) |
            (df['ID получаемой валюты'] == 2) |
            (df['ID получаемой валюты'] == 76) |
            (df['ID получаемой валюты'] == 144) |
            (df['ID получаемой валюты'] == 209) |
            (df['ID получаемой валюты'] == 52) |
            (df['ID получаемой валюты'] == 42) |
            (df['ID получаемой валюты'] == 63) |
            (df['ID получаемой валюты'] == 105)
            ]

    df.loc[(df['ID получаемой валюты'] == 93), 'ID получаемой валюты'] = 'Bitcoin (BTC)'
    df.loc[(df['ID получаемой валюты'] == 131), 'ID получаемой валюты'] = 'Bitcoin LN (BTC)'
    df.loc[(df['ID получаемой валюты'] == 43), 'ID получаемой валюты'] = 'Bitcoin BEP20 (BTCB)'
    df.loc[(df['ID получаемой валюты'] == 184), 'ID получаемой валюты'] = 'Bitcoin Gold (BTG)'
    df.loc[(df['ID получаемой валюты'] == 139), 'ID получаемой валюты'] = 'Ethereum (ETH)'
    df.loc[(df['ID получаемой валюты'] == 212), 'ID получаемой валюты'] = 'Ethereum BEP20 (ETH)'
    df.loc[(df['ID получаемой валюты'] == 218), 'ID получаемой валюты'] = 'Wrapped ETH (WETH)'
    df.loc[(df['ID получаемой валюты'] == 160), 'ID получаемой валюты'] = 'Ether Classic (ETC)'
    df.loc[(df['ID получаемой валюты'] == 99), 'ID получаемой валюты'] = 'Litecoin (LTC)'
    df.loc[(df['ID получаемой валюты'] == 161), 'ID получаемой валюты'] = 'Ripple (XRP)'
    df.loc[(df['ID получаемой валюты'] == 149), 'ID получаемой валюты'] = 'Monero (XMR)'
    df.loc[(df['ID получаемой валюты'] == 115), 'ID получаемой валюты'] = 'Dogecoin (DOGE),DOGE'
    df.loc[(df['ID получаемой валюты'] == 140), 'ID получаемой валюты'] = 'Dash (DASH)'
    df.loc[(df['ID получаемой валюты'] == 162), 'ID получаемой валюты'] = 'Zcash (ZEC)'
    df.loc[(df['ID получаемой валюты'] == 163), 'ID получаемой валюты'] = 'Tether Omni (USDT)'
    df.loc[(df['ID получаемой валюты'] == 36), 'ID получаемой валюты'] = 'Tether ERC20 (USDT)'
    df.loc[(df['ID получаемой валюты'] == 10), 'ID получаемой валюты'] = 'Tether TRC20 (USDT)'
    df.loc[(df['ID получаемой валюты'] == 208), 'ID получаемой валюты'] = 'Tether BEP20 (USDT)'
    df.loc[(df['ID получаемой валюты'] == 180), 'ID получаемой валюты'] = 'Tether SOL (USDT)'
    df.loc[(df['ID получаемой валюты'] == 23), 'ID получаемой валюты'] = 'USDCoin ERC20 (USDC)'
    df.loc[(df['ID получаемой валюты'] == 110), 'ID получаемой валюты'] = 'USDCoin TRC20 (USDC)'
    df.loc[(df['ID получаемой валюты'] == 235), 'ID получаемой валюты'] = 'USDCoin BEP20 (USDC)'
    df.loc[(df['ID получаемой валюты'] == 228), 'ID получаемой валюты'] = 'USDCoin SOL (USDC)'
    df.loc[(df['ID получаемой валюты'] == 24), 'ID получаемой валюты'] = 'TrueUSD (TUSD)'
    df.loc[(df['ID получаемой валюты'] == 189), 'ID получаемой валюты'] = 'Pax Dollar (USDP)'
    df.loc[(df['ID получаемой валюты'] == 203), 'ID получаемой валюты'] = 'Dai (DAI)'
    df.loc[(df['ID получаемой валюты'] == 206), 'ID получаемой валюты'] = 'Binance USD (BUSD)'
    df.loc[(df['ID получаемой валюты'] == 174), 'ID получаемой валюты'] = 'TerraUSD (UST)'
    df.loc[(df['ID получаемой валюты'] == 173), 'ID получаемой валюты'] = 'NEM (XEM)'
    df.loc[(df['ID получаемой валюты'] == 177), 'ID получаемой валюты'] = 'NEO (NEO)'
    df.loc[(df['ID получаемой валюты'] == 178), 'ID получаемой валюты'] = 'EOS (EOS)'
    df.loc[(df['ID получаемой валюты'] == 179), 'ID получаемой валюты'] = 'IOTA (MIOTA)'
    df.loc[(df['ID получаемой валюты'] == 181), 'ID получаемой валюты'] = 'Cardano (ADA)'
    df.loc[(df['ID получаемой валюты'] == 182), 'ID получаемой валюты'] = 'Stellar (XLM)'
    df.loc[(df['ID получаемой валюты'] == 185), 'ID получаемой валюты'] = 'TRON (TRX)'
    df.loc[(df['ID получаемой валюты'] == 133), 'ID получаемой валюты'] = 'Waves (WAVES)'
    df.loc[(df['ID получаемой валюты'] == 48), 'ID получаемой валюты'] = 'OMG Network (OMG)'
    df.loc[(df['ID получаемой валюты'] == 124), 'ID получаемой валюты'] = 'Verge (XVG)'
    df.loc[(df['ID получаемой валюты'] == 168), 'ID получаемой валюты'] = '0x (ZRX)'
    df.loc[(df['ID получаемой валюты'] == 16), 'ID получаемой валюты'] = 'BinanceCoin BEP2 (BNB)'
    df.loc[(df['ID получаемой валюты'] == 19), 'ID получаемой валюты'] = 'BinanceCoin BEP20 (BNB)'
    df.loc[(df['ID получаемой валюты'] == 104), 'ID получаемой валюты'] = 'ICON (ICX)'
    df.loc[(df['ID получаемой валюты'] == 134), 'ID получаемой валюты'] = 'Komodo (KMD)'
    df.loc[(df['ID получаемой валюты'] == 27), 'ID получаемой валюты'] = 'BitTorrent (BTT)'
    df.loc[(df['ID получаемой валюты'] == 61), 'ID получаемой валюты'] = 'BAT (BAT)'
    df.loc[(df['ID получаемой валюты'] == 135), 'ID получаемой валюты'] = 'Ontology (ONT)'
    df.loc[(df['ID получаемой валюты'] == 26), 'ID получаемой валюты'] = 'Qtum (QTUM)'
    df.loc[(df['ID получаемой валюты'] == 197), 'ID получаемой валюты'] = 'Chainlink (LINK)'
    df.loc[(df['ID получаемой валюты'] == 198), 'ID получаемой валюты'] = 'Cosmos (ATOM)'
    df.loc[(df['ID получаемой валюты'] == 175), 'ID получаемой валюты'] = 'Tezos (XTZ)'
    df.loc[(df['ID получаемой валюты'] == 201), 'ID получаемой валюты'] = 'Polkadot (DOT)'
    df.loc[(df['ID получаемой валюты'] == 202), 'ID получаемой валюты'] = 'Uniswap (UNI)'
    df.loc[(df['ID получаемой валюты'] == 205), 'ID получаемой валюты'] = 'Ravencoin (RVN)'
    df.loc[(df['ID получаемой валюты'] == 82), 'ID получаемой валюты'] = 'Solana (SOL)'
    df.loc[(df['ID получаемой валюты'] == 8), 'ID получаемой валюты'] = 'VeChain (VET)'
    df.loc[(df['ID получаемой валюты'] == 210), 'ID получаемой валюты'] = 'Shiba ERC20 (SHIB)'
    df.loc[(df['ID получаемой валюты'] == 32), 'ID получаемой валюты'] = 'Shiba BEP20 (SHIB)'
    df.loc[(df['ID получаемой валюты'] == 216), 'ID получаемой валюты'] = 'Algorand (ALGO)'
    df.loc[(df['ID получаемой валюты'] == 213), 'ID получаемой валюты'] = 'Maker (MKR)'
    df.loc[(df['ID получаемой валюты'] == 217), 'ID получаемой валюты'] = 'Avalanche (AVAX)'
    df.loc[(df['ID получаемой валюты'] == 220), 'ID получаемой валюты'] = 'Yearn.finance (YFI)'
    df.loc[(df['ID получаемой валюты'] == 227), 'ID получаемой валюты'] = 'Decentraland (MANA)'
    df.loc[(df['ID получаемой валюты'] == 2), 'ID получаемой валюты'] = 'Terra (LUNA)'
    df.loc[(df['ID получаемой валюты'] == 76), 'ID получаемой валюты'] = 'NEAR Protocol (NEAR)'
    df.loc[(df['ID получаемой валюты'] == 144), 'ID получаемой валюты'] = 'Cronos (CRO)'
    df.loc[(df['ID получаемой валюты'] == 209), 'ID получаемой валюты'] = 'Toncoin (TON)'
    df.loc[(df['ID получаемой валюты'] == 52), 'ID получаемой валюты'] = 'RUB Альфа-Банк'
    df.loc[(df['ID получаемой валюты'] == 42), 'ID получаемой валюты'] = 'RUB Сбербанк'
    df.loc[(df['ID получаемой валюты'] == 63), 'ID получаемой валюты'] = 'RUB QIWI'
    df.loc[(df['ID получаемой валюты'] == 105), 'ID получаемой валюты'] = 'RUB Тинькофф'
    df.loc[(df['ID получаемой валюты'] == 172), 'ID получаемой валюты'] = 'Bitcoin Cash (BCH)'
    df.loc[(df['ID получаемой валюты'] == 138), 'ID получаемой валюты'] = 'Polygon (MATIC)'

    df.rename(columns={"ID отдаваемой валюты": "currency"}, inplace=True)
    df.rename(columns={"ID получаемой валюты": "cryptocurrency"}, inplace=True)
    df.rename(columns={"Курс обмена (отдать)": "price_give"}, inplace=True)
    df.rename(columns={"Курс обмена (получить)": "price_get"}, inplace=True)
    df = df[['currency', 'cryptocurrency', 'price_give', 'price_get']]

    df.to_sql(name='bestchange', con=db, if_exists='replace', index=False)

